{"posts":[{"title":"A Symphony in Code","text":"Who Am IHey, I’m Bibit Kunwar Chhetri. I’m someone who genuinely enjoys learning — not just the easy stuff, but the kind of learning that takes time, effort, failure, and patience. I’ve always felt that going the hard way teaches me things that shortcuts never could. That’s the path I’ve chosen — one where growth comes from struggle, and clarity from chaos. Software engineering didn’t just give me a career path — it gave me a different way of thinking. A way to break problems into pieces, to see structure where there was once noise, and to constantly seek better answers — in code and in life. About This SiteThis website is where I’ll slowly open up about the things I go through — the new technologies I explore, the hurdles I face, the thoughts that stick with me, and the people I meet along the way. I want this space to feel real, not polished or performative. Some posts might be technical, some reflective, some might just be me trying to figure something out. I don’t have all the answers. I probably never will. But I’m here to share what I know, what I’m learning, what I’m feeling — all in my own time and in my own words. Why I’m HereI’ve always admired how open source works — people coming together to build, to fix, to learn. I hope to contribute to that spirit, not just with code but with honesty. Whatever I go through — whether it’s confusion, excitement, burnout, or breakthrough — I’ll try to share it here. Because that’s how we connect. That’s how we grow. This is just the beginning. I don’t know exactly where I’ll end up, what kind of engineer I’ll become, or what kind of people I’ll meet — but I’m here for it. And I’ll take you along, one post at a time.","link":"/2025/05/31/hello-world/"}],"tags":[{"name":"Intro","slug":"Intro","link":"/tags/Intro/"},{"name":"SoftwareEngineering","slug":"SoftwareEngineering","link":"/tags/SoftwareEngineering/"},{"name":"OpenSource","slug":"OpenSource","link":"/tags/OpenSource/"},{"name":"Learning","slug":"Learning","link":"/tags/Learning/"},{"name":"Life","slug":"Life","link":"/tags/Life/"},{"name":"Thoughts","slug":"Thoughts","link":"/tags/Thoughts/"}],"categories":[{"name":"Personal","slug":"Personal","link":"/categories/Personal/"}],"pages":[{"title":"Curriculum Vitae","text":"Curriculum Vitae Coming Soon! Stay tuned for more details about my professional journey. I'm currently working on creating a comprehensive Curriculum Vitae to share with you. .coming-soon-notice { background-color: #f8d7da; color: #721c24; border: 1px solid #f5c6cb; padding: 15px; border-radius: 5px; margin-bottom: 20px; } .coming-soon-notice h2 { color: #721c24; }","link":"/curriculum/index.html"},{"title":"About","text":"Discover More About Me Soon! I'm in the process of crafting a detailed narrative about who I am, my journey, and what motivates me. Stay tuned for a closer look into my background and aspirations. .coming-soon-notice { background-color: #f8d7da; color: #721c24; border: 1px solid #f5c6cb; padding: 15px; border-radius: 5px; margin-bottom: 20px; } .coming-soon-notice h2 { color: #721c24; }","link":"/about/index.html"},{"title":"Projects &amp; Research","text":"Exciting Projects Coming Soon! I'm actively working on a variety of projects that showcase my skills and passion. Stay tuned for updates on innovative and impactful endeavors. .coming-soon-notice { background-color: #d4edda; color: #155724; border: 1px solid #c3e6cb; padding: 15px; border-radius: 5px; margin-bottom: 20px; } .coming-soon-notice h2 { color: #155724; }","link":"/projects/index.html"},{"title":"Terms of Service and Privacy Policy","text":"Terms of ServiceIntroductionWelcome to Bibit Kunwar Chhetri’s Free and Open Source Blog! By accessing this website, you agree to comply with and be bound by the following terms and conditions of use. If you disagree with any part of these terms, please do not use this website. CopyLeft and SharingThis blog is released under the principles of the GNU General Public License (GPL). You are free to view, modify, and share the content of this blog, subject to the conditions of the GPL. Intellectual Property and CopyrightThe content on this blog, including text, images, and other materials, is copyrighted by Bibit Kunwar Chhetri and is released under the terms of the GPL. You are free to copy, distribute, and modify the content as long as you attribute the work to Bibit Kunwar Chhetri. Personal ResponsibilityThe information provided on this blog is for general informational purposes only. It does not constitute professional advice. You are solely responsible for how you use the information presented on this blog. Comments and ContributionsWe encourage respectful and constructive discussions in the comments section. Contributions to the blog are also welcomed, following the guidelines of the GPL. External LinksThis blog may contain links to external websites. We are not responsible for the content or privacy practices of these external sites. Changes to TermsWe reserve the right to modify these terms at any time. By continuing to use the site after changes are posted, you accept the modified terms. Privacy PolicyInformation CollectionWe may collect personal information, such as your name and email address, when you voluntarily submit it, for example, when leaving comments or subscribing to newsletters. Use of InformationAny personal information you provide will be used solely for the purpose for which it was collected. We will not sell or share your information with third parties without your consent. CookiesThis blog may use cookies to enhance your browsing experience. You can disable cookies in your browser settings if you prefer. AnalyticsWe may use analytics services to track and analyze user behavior on this website. This information is used to improve the content and user experience. SecurityWe take reasonable measures to protect your personal information. However, we cannot guarantee the security of information transmitted over the internet. Contact InformationIf you have any questions or concerns about these terms or the privacy policy, you can contact Bibit Kunwar Chhetri at kunwar.bibit7@gmail.com. This blog is released under the GNU General Public License.","link":"/policy/index.html"},{"title":"I write my life here...","text":"Explore My Life's Journey Soon! Get ready to delve into my life experiences, adventures, and reflections. I'm working on sharing my personal journey with you in a meaningful way. .coming-soon-notice { background-color: #cce5ff; color: #004085; border: 1px solid #b8daff; padding: 15px; border-radius: 5px; margin-bottom: 20px; } .coming-soon-notice h2 { color: #004085; }","link":"/life/index.html"}]}